export const article = {
  title: "راهنمای جامع قراردادهای اختیار معامله",
  imageUrl: "src/pages/learning/data/pic.png",

  level: "مقدماتی",
  readingTime: "۸ دقیقه",
  publishDate: "۱۴۰۳/۰۷/۱۴",

  sections: [
    {
      id: "what-is-option",

      content:
        "معاملات آپشن یکی از ابزارهای پیشرفته مالی محسوب می‌شوند که به سرمایه‌گذاران این امکان را می‌دهند تا با استفاده از قراردادهای خاص، در عین مدیریت ریسک سرمایه‌گذاری‌های خود، سود بالقوه بیشتری را هدف‌گذاری کنند. در این مقاله، قصد داریم مفاهیم ابتدایی این ابزار مالی و کاربردهای آن را مورد بررسی قرار دهیم.",
    },
    {
      id: "what-is-option",
      title: "معاملات آپشن چیست؟",
      content:
        "معاملات آپشن به قراردادهایی گفته می‌شود که به خریدار این حق را می‌دهند (و نه الزام) که بتواند دارایی مشخصی را در یک قیمت تعیین‌شده و تا یک تاریخ معین خریداری یا به فروش برساند. این دارایی‌ها می‌توانند شامل سهام، کالا، ارزهای دیجیتال یا سایر ابزارهای مالی باشند. این ویژگی انعطاف‌پذیری بالا، معاملات آپشن را به ابزاری مناسب برای مدیریت ریسک و کسب سود تبدیل کرده است.",
    },
    {
      id: "call-and-put",
      title: "انواع اختیار معامله",
      content:
        "اختیار معامله به دو نوع اصلی اختیار خرید و اختیار فروش تقسیم می‌شود. انتخاب هرکدام به تحلیل معامله‌گر از روند قیمت دارایی پایه بستگی دارد.",
      subsections: [
        {
          id: "call-option",
          title: "اختیار خرید (Call)",
          content:
            "خریدار اختیار خرید معمولاً انتظار دارد قیمت دارایی پایه افزایش پیدا کند. این قرارداد به او حق خرید دارایی را با قیمت اعمال می‌دهد.",
        },
        {
          id: "put-option",
          title: "اختیار فروش (Put)",
          content:
            "خریدار اختیار فروش معمولاً از این قرارداد برای کسب سود از افت قیمت یا پوشش ریسک دارایی‌های خود استفاده می‌کند.",
        },
      ],
    },
    {
      id: "contract-components",
      title: "اجزای اصلی قرارداد",
      content:
        "برای تحلیل قراردادهای اختیار معامله، آشنایی با قیمت اعمال، تاریخ سررسید و بهای اختیار ضروری است. این عوامل روی ارزش و ریسک قرارداد اثر می‌گذارند.",
    },
    {
      id: "risks",
      title: "مزایا و ریسک‌ها",
      content:
        "اختیار معامله می‌تواند برای مدیریت ریسک و استفاده از فرصت‌های بازار کاربرد داشته باشد؛ بااین‌حال، نوسان قیمت و نزدیک‌شدن به سررسید ممکن است باعث کاهش ارزش قرارداد شود.",
    },
  ],
};

// ساخت HTML مقاله از روی دیتای ماک
export const contentHtml = article.sections
  .map(
    (section) => `
      <section>
        <h2 class="text-heading-small leading-10"  id="${section.id}">${section.title}</h2>
        <p class="leading-8">${section.content}</p>

        ${
          section.subsections
            ?.map(
              (sub) => `
                <div>
                  <h3 class="text-body-large leading-10" id="${sub.id}">${sub.title}</h3>
                  <p class="leading-8">${sub.content}</p>
                </div>
              `,
            )
            .join("") ?? ""
        }
      </section>
    `,
  )
  .join("");
